//// Дано целове число n (<0). Если оно является степенью числа 3, то вывести true, если не является - вывести false.
//#include <stdio.h>
//
//int main(){
//    int num;
//    printf("Введите число: ");
//    scanf("%d", &num);
//    while (num > 0) {
//        num -= 3;
//    }
//    if (num == 0){
//        printf("True \n");
//    }
//    else{
//        printf("False \n");
//    }
//}
